{
    "releasenotes": {
        "version": {
            "int": 145,
            "str": "1.4.5"
        },
        "items": [
            {
                "isFeature": true,
                "date": "20241001",
                "title": "Improved search",
                "description": "The element `Labrador Search` now supports layout in one, two, three or four columns and advanced search. Users can search for autor, tag and publish dates."
            },
            {
                "isFeature": true,
                "date": "20241001",
                "title": "Drop Caps",
                "description": "Support for drop caps in bodytext added. Available in the menu 'Styles' / 'Drop Caps'. Hotkey `Ctrl/Cmd+7`. The first letter of the paragraph will span three lines."
            },
            {
                "isFeature": true,
                "date": "20240924",
                "title": "Option to blur article behind paywall.",
                "description": "Added option to blur the content of an article behind a paywall. This can be enabled in Admin -> Article settings . The blur effect is applied to the entire article, including images and text, while the header is shown. Will only work on internal paywalls."
            },
            {
                "isFeature": true,
                "date": "20240917",
                "title": "Settings for article to be able to disable skyscraper ads",
                "description": "In settings on single article editors can choose to disable skyscraper ads. Option `Hide skyscraper ads` under `Article Settings`/`Commercial settings`"
            },
            {
                "isFeature": true,
                "date": "20240909",
                "title": "Changelog Management for Articles",
                "description": "Introduced the ability to add and manage changelogs within article settings. Changelogs can now be published directly on individual articles using a dedicated element, allowing readers to track changes. Additionally, a global changelog element is available to display all updates across the entire site."
            },
            {
                "isFeature": true,
                "date": "20240909",
                "title": "Grid element",
                "description": "Most places you can drop an image you can now drop the new Grid element. This element can display any number of media or text elements in a grid. You can set the number of columns and rows in the settings panel (hotkey `,`). Default 3 * 4. For article teasers: 2 * 1. The grid element supports image, graphic, youtube (with autoplay), text multiline, text title, text subtitle and markup."
            },
            {
                "isFeature": true,
                "date": "20240910",
                "title": "Infinite scroll",
                "description": "Via the new admin page for auto inserting content on your pages you can now insert an element delivering 'infinite scroll'. Select a front page to use and number of rows to load. When user scrolls down more rows are fetched from the selected front page. The element is non persistent, meaning that modifications will affect both existing and new pages. You can also specify conditions for when the element should be inserted. This allow you to use one front page for section 'news' and another for section 'sport' for example.",
                "links": [
                    "/settings/cp?page=autoInsert"
                ]
            },
            {
                "isFeature": true,
                "date": "20240909",
                "title": "Insert related content via admin pages",
                "description": "Many customers insert the element 'Front rows' below articles in prototypes. This can now be done in the admin pages. The inserted elements are non persistent, meaning that modifications will affect both existing and new pages. You can also specify conditions for when the element should be inserted. This allow you to use one front page for section 'news' and another for section 'sport' for example.",
                "links": [
                    "/settings/cp?page=autoInsert"
                ]
            },
            {
                "isFeature": true,
                "date": "20240629",
                "title": "Live studio - Commercialization",
                "description": "You can now display ads on notice pages and between notices in the Livefeed element. The placement `Livefeed - Client side - Initial` will insert ads around existing notices while the placement `Livefeed - Client side - Updates` will insert ads around new notices added after page load. In this case the `index` parameter is the number of new notices required before the ad is inserted. So an index of `1` will insert the ad above every new notice. An index of `2` will insert the ad above every second new notice.",
                "links": [
                    "/settings/cp?page=ads"
                ]
            },
            {
                "isFeature": true,
                "date": "20240628",
                "title": "Auto Font Size Adjustment for Article Teaser Titles",
                "description": "We have introduced a new feature that allows automatic font size adjustment for article teaser titles, ensuring the title text splits into lines and adjusts its size to fit the width of the text block. Enable this feature in the admin panel under text options using the checkbox, and then adjust the settings for each front page in the editor. Additionally, there is a new setting under the article teaser title to disable this feature for individual teasers. When this feature is enabled, other styling options for the title will be unavailable. Line breaks can be added by pressing Shift+Enter to force breaks at specific points."
            },
            {
                "isFeature": true,
                "date": "20240627",
                "title": "Custom Social Media Image for Frontpages",
                "description": "You will now be able to select a custom image for your frontpages. This image will be used when sharing the frontpage on social media. You can set the image in the settings page on any frontpage, under \"SEO-settings\" > \"Social Media\"."
            },
            {
                "isFeature": true,
                "date": "20240611",
                "title": "Slack notifications",
                "description": "We've added the plugin `Slack notifier` that will post messages to a Slack channel when an article, front page or notice is published. It can also notify you in a Slack channel if an error occurred in the editor. You activate this feature in the settings-pages for plugins. You need to create a Slack app and get a webhook URL to use this feature. You can define requirements for when a message should be posted, such as only for articles with a specific tag or section. You can also define a message template with placeholders for the page title, user, tags and URLs. You set up the template in the settings page for language options.",
                "links": [
                    "/settings/cp?page=plugins",
                    "/settings/cp?page=localisation"
                ]
            },
            {
                "isFeature": true,
                "date": "20240607",
                "title": "Live studio",
                "description": "You can now create live studios in Labrador CMS. The main part of this is the element `Live Feed`. This can display notices, article teasers and images. You can build a studio around this element as you like with related articles, factboxes etc. The live feed is labeled by tags, and notices matching these tags are automatically displayed. New or updated notices are automatically displayed to end users. To start, hit `C` and drag the element `livefeed` onto a page. Hit `Shift+N` to create a new notice. Label for the related articles below a notice can be modified on the page for language settings.",
                "links": [
                    "/settings/cp?page=localisation"
                ]
            },
            {
                "isFeature": true,
                "date": "20240606",
                "title": "Buttonlink content element",
                "description": "New element Button link. This is a link shaped as a button. You can set the text, link and color of the button, alongside shadow and shape, and hover colors. May require a new save of Colors in admin panel."
            },
            {
                "isBug": true,
                "date": "20240524",
                "title": "Paywall label in editor",
                "description": "When adding an article teaser to the bodytext of an article the paywall label is now shown in the editor as well as on the published page. Previously it was only shown on the published page."
            },
            {
                "isImprovement": true,
                "date": "20240523",
                "title": "Improved UI for tags",
                "description": "When you add or remove tags in the settings panel for articles the input field is automatically focused to make it easier to add multiple tags."
            },
            {
                "isFeature": true,
                "date": "20240516",
                "title": "Self service for comments providers",
                "description": "[Baseview] You can now set up your preferred comments provider in the settings page. Supported providers: Disqus, Facebook, Hyvor and Commento. Option to hide comment section for articles behind paywall for users without access added.",
                "links": [
                    "/settings/cp?page=comments_provider"
                ]
            }
        ]
    }
}
