{
    "releasenotes": {
        "version": {
            "int": 148,
            "str": "1.4.8"
        },
        "items": [
            {
                "isImprovement": true,
                "date": "20241115",
                "title": "Style menu added to images in bodytext",
                "description": "You can now use the style system to store and automatically apply a style to images dropped onto the bodytext of an article. The style menu is available in the image context menu."
            },
            {
                "isImprovement": true,
                "date": "20241125",
                "title": "Share articles on Bluesky",
                "description": "End users can now share your articles on Bluesky. Activate the share button is the admin pages.",
                "links": [
                    "/settings/cp?page=articleSettings"
                ]
            },
            {
                "isImprovement": true,
                "date": "20241208",
                "title": "Improved A/B tests",
                "description": "Several improvements are done to the A/B test feature including estimate of the duration of a test, the original article teaser display correct title in the Kilkaya GUI making it easier to identify, articles with tests are only highlighted on the page where the test actually run, validation of variants and more."
            },
            {
                "isFeature": true,
                "date": "20250102",
                "title": "Added possibility to set rel attribute on links and article teasers",
                "description": "Users can now set the rel attributes on links, when adding links to the body text, and also in articles, via article settings. This is useful for SEO purposes."
            },
            {
                "isFeature": true,
                "date": "20241216",
                "title": "Enable shareable paywalled article",
                "description": "You can now enable sharing of paywalled articles if your paywall integration supports this. Enable the feature in the admin page 'Article settings' -> 'Commercial settings' -> 'Shareable paywalled article', then go to the article and enable sharing in 'Article Settings' -> 'Commercial settings'. You can also customize the text for article sharing in the admin page 'Language options' -> 'Paywall' -> 'Share paywalled article'",
                "links": [
                    "/settings/cp?page=articleSettings",
                    "/settings/cp?page=localisation"
                ]
            },
            {
                "isImprovement": true,
                "date": "20241208",
                "title": "Add and modify approval article statuses",
                "description": "You can now add and rename approval article statuses in the admin page 'Article settings' -> 'Article approval statuses'. These approval statuses and descriptions can be used in the article's 'Article Settings' -> 'Article status' (renamed from 'Approval')",
                "links": [
                    "/settings/cp?page=articleSettings"
                ]
            },
            {
                "isFeature": true,
                "date": "20250124",
                "title": "Added button in Tagboard to retain checkbox selection after reload",
                "description": "End-users can now retain the selection of checkboxes in the Tagboard after a page reload. This data is stored locally on the end-users browser. This is useful when you want to keep the selection of tags when you navigate between pages in the Tagboard, or visit again after you leave the site. Button is available in the Tagboard settings, at the bottom of Source/Articles."
            },
            {
                "isImprovement": true,
                "date": "20250121",
                "title": "Tansa update",
                "description": "The implementation of Tansa spellchecker has been updated. You can now use it for article teasers, factboxes and images added to articles as well as the previus supported text fields. Klick the Tansa icon and Labrador + Tansa do the rest for you. If you're not using Tansa yet you can enable the feature in the Tansa admin page.",
                "links": [
                    "/settings/cp?page=tansa"
                ]
            },
            {
                "isFeature": true,
                "date": "20250128",
                "title": "Oembed-support added",
                "description": "Labrador articles can now be embedded in other systems using the Oembed standard. The Oembed endpoint is reached by adding `?lab_viewport=oembed` to any article url."
            },
            {
                "isFeature": true,
                "date": "20250128",
                "title": "Feeds from Labrador API",
                "description": "Elements such as Article scroller, Front content and Tagboard now supports feeds from the Labrador API. You set up these feeds using urls like this: `{{api}}/article/?query=tag:my_tag`.",
                "links": [
                    "/settings/feeds"
                ]
            },
            {
                "isFeature": true,
                "date": "20250130",
                "title": "Added option to hide comments via the url",
                "description": "The argument `lab_opts` can be used to hide the comments of the page. Example: `?lab_opts=hideComments`"
            },
            {
                "isImprovement": true,
                "date": "20250211",
                "title": "Labrador AI custom prompts",
                "description": "You may now add custom prompts to several of the Labrador AI features. You can also fine tune the instructions from the AI panel in the editor for articles.",
                "links": [
                    "/settings/cp?page=labradorAi"
                ]
            },
            {
                "isImprovement": true,
                "date": "20250211",
                "title": "Labrador AI article translation",
                "description": "You may now add custom prompts and have an overview of the translated articles. You can predefine your setup in admin page 'Multi language' and specify the translation instruction in admin page 'Labrador AI'.",
                "links": [
                    "/settings/cp?page=multiLanguage",
                    "/settings/cp?page=labradorAi"
                ]
            }
        ]
    }
}
