{
    "releasenotes": {
        "version": {
            "int": 149,
            "str": "1.4.9"
        },
        "items": [
            {
                "isBug": true,
                "date": "20250227",
                "title": "Tansa spellcheck",
                "description": "A bug where the Tansa spellcheck stored placeholder values has been fixed. This could lead to texts like 'Click to add byline' etc. being displayed on published pages after doing a spell check."
            },
            {
                "isImprovement": true,
                "date": "20250307",
                "title": "Tagboard improvements",
                "description": "Users can now decide on the amount of articles fetched, and the amount of articles displayed in the Tagboard. Tagboard also comes with option to hide hits per tag. Additionally, amount of articles displayed is shown in the Set Number of Columns option, in the Group Articles Tab."
            },
            {
                "isImprovement": true,
                "date": "20250319",
                "title": "Published date on front articles",
                "description": "It is now possible to display the published date on front articles. The option for this is found in the hamburger menu on an article, below the 'Toggle bylines' option."
            },
            {
                "isFeature": true,
                "date": "20250319",
                "title": "Self service: Page width",
                "description": "It is now possible to set the page width for desktop viewport in the admin pages. This allows you to modift the size of the content area of your pages.",
                "links": [
                    "/settings/cp?page=layout"
                ]
            },
            {
                "isFeature": true,
                "date": "20250506",
                "title": "AI Paywall functionality (Internal)",
                "description": "It is now possible to set AI generated salespitch text to your internal paywalls. Simply go to a paywalled article, or enable a paywall article to reveal a button in the right drawer, where you can click to enable a paywallPreview with several options.",
                "links": [
                    "/settings/cp?page=labradorAi"
                ]
            },
            {
                "isBug": true,
                "date": "20250506",
                "title": "Auto detect language removal",
                "description": "AI is not good enough currently to consistently generate auto detected language through prompting, this will be added back in a future where the AI understands the promp and context better, for now please use the 'Use Defualt Site Language' and if needed, select a specific language when generating with extra settings"
            },
            {
                "isFeature": true,
                "date": "20250602",
                "title": "Article teaser video overlay",
                "description": "Adds an option to add a video overlay to article teasers. This shows a play icon and descriptive text indicating that it is a video article. The text can be hidden, or changed in Language Options."
            },
            {
                "isImprovement": true,
                "date": "20250526",
                "title": "Notice font styles",
                "description": "Font styles in admin now include selectors for headline, published time, author, tags and body text."
            }
        ]
    }
}
